{
  "Introduction": {
    "paragraphs": [
      "Data Engineering",
      "Jobs run’s",
      "The Jobs & Pipelines interface in Azure Databricks provides a unified orchestration layer for data engineering and machine learning workflows.It supports job scheduling, dependency management, pipeline orchestration, and execution monitoring.",
      "Key Features",
      "Ingestion Pipelines: Automate ingestion from external data sources (databases, APIs, or files).",
      "ETL Pipelines: Design scalable, production-grade ETL processes using SQL, PySpark, or Python.",
      "Jobs: Orchestrate notebooks, workflows, pipelines, and queries; configure parameters, cluster settings, and triggers.",
      "Job Runs Dashboard: Monitor run history, logs, and metrics for troubleshooting and optimization.",
      "Access Control: Manage visibility (“Owned by me,” “Accessible by me”) to enforce workspace-level governance.",
      "Use Case",
      "Used by data engineers and ML teams to build end-to-end pipelines — from data ingestion to transformation, feature generation, and model retraining — all under one environment.",
      "The Job Runs dashboard in Databricks provides an operational view of scheduled or triggered workflows.It allows engineers and ML teams to monitor, debug, and analyze job executions across environments.",
      "Key Functionalities",
      "Run Filtering: Filter runs by job, user, time range, run status, or error code.",
      "Run Visualization: Graph at the top visualizes the number of successful, failed, or skipped runs over time.",
      "Detailed Metadata: For each run, Databricks records the execution context — start/end time, duration, compute used, and run parameters.",
      "Error Handling: Provides error codes and logs to diagnose failure causes (e.g., cluster issues, data errors, script exceptions).",
      "Audit & Compliance: Maintains a complete audit trail for all pipeline executions — critical for production governance.",
      "What You See:",
      "Start time → When the job started.",
      "Job name → Which job ran (for example, “ETL Pipeline”).",
      "Run as → Which user or role ran it.",
      "Duration → How long it took.",
      "Status → Shows if it succeeded, failed, or skipped.",
      "Error code → Displays the error message if something failed.",
      "Run parameters → Lists any input values (like parameters) used in that run.",
      "Data Ingestion",
      "Data ingestion means bringing data into Databricks from different sources — databases, APIs, files, or cloud storage — so that you can analyze or transform it later.",
      "It’s the first step in any data pipeline or analytics workflow.",
      "The Data Ingestion tab acts as a centralized data onboarding interface.It supports:",
      "Direct connectors for enterprise systems",
      "File-based uploads into Unity Catalog-managed storage",
      "Automation tools like Fivetran and Partner Connect",
      "Delta Lake and ADLS integrations for scalable storage",
      "It ensures schema consistency, metadata registration, and secure data governance under Unity Catalog.",
      "Header:➡️ Add data",
      "Purpose:Guides you to connect data sources, upload files, or create tables for analysis.",
      "Main Sections and Options",
      "Databricks Connectors",
      "These are pre-built connectors to quickly connect to popular data platforms:",
      "Connector",
      "Description",
      "Typical Use Case",
      "🔹 Salesforce",
      "Connect to CRM data (leads, opportunities, accounts).",
      "Analyze customer and sales performance.",
      "🔹 SAP Business Data Cloud",
      "Access enterprise resource data from SAP.",
      "Supply chain or financial reporting.",
      "🔹 Workday Reports",
      "Retrieve HR, payroll, and workforce data.",
      "Workforce analytics and reporting.",
      "🔹 ServiceNow",
      "Connect IT service management data.",
      "Incident and change management insights.",
      "🔹 Google Analytics Raw Data",
      "Import website and marketing analytics data.",
      "Digital marketing and campaign performance.",
      "🔹 SQL Server",
      "Connect on-prem or cloud-hosted SQL databases.",
      "Bring structured transactional data into Databricks.",
      "Files Section",
      "For manual uploads or storage-based ingestion.",
      "Option",
      "Description",
      "When to Use",
      "📤 Create or modify table",
      "Upload files like CSV, JSON, or Parquet to create or replace tables.",
      "Ideal for one-time imports or small datasets.",
      "📁 Upload files to a volume",
      "Upload non-tabular files (images, logs, etc.) managed under Unity Catalog Volumes.",
      "For non-structured data like logs, models, or raw files.",
      "☁️ Create table from Azure Data Lake Storage (ADLS)",
      "Load data directly from Azure Data Lake into a Delta table.",
      "For large-scale, enterprise-grade data pipelines.",
      "Fivetran Connectors (via Partner Connect)",
      "At the bottom, you’ll find:",
      "“See all available ingest partners in Partner Connect.”",
      "Partner Connect lets you integrate tools like:",
      "Fivetran, Informatica, Qlik, etc.to automate ingestion from hundreds of data sources into Databricks."
    ],
    "images": []
  },
  "AI/ML": {
    "paragraphs": [
      "AI/ML",
      "Playground",
      "The Playground in Databricks is an interactive environment where you can experiment with AI models, build and test prompts, and prototype intelligent agents before deploying them into production.",
      "It’s like a sandbox for Generative AI within your Databricks workspace.",
      "Chat with or test AI models (like GPT, MPT, or Llama).",
      "Ask questions, summarize documents, or generate code.",
      "Try out small AI tasks (like question answering or summarization) before building real applications.",
      "A low-code interface for LLM prompt engineering and evaluation.",
      "Integration with Unity Catalog tools for secure, governed model use.",
      "The ability to prototype AI agents with custom tools, such as function calling, retrieval-augmented generation (RAG), and data-aware AI.",
      "Seamless connection to Databricks’ MLflow, Feature Store, and Model Serving for deployment.",
      "Main Components on the Page",
      "Section",
      "Description",
      "Purpose",
      "Model Selector (Top Bar)",
      "Shows the current model (e.g., GPT OSS 120B). You can switch between models here.",
      "Choose which AI model to test or fine-tune.",
      "Tools Menu",
      "Access to tools or APIs integrated with the model (like function calling, RAG, or evaluation tools).",
      "Extend the model’s capabilities using custom or pre-built tools.",
      "Prototype an Agent",
      "Lets you add your own tool and connect it to a model to create AI agents.",
      "Build task-oriented AI agents (e.g., summarizer, SQL generator, chatbot).",
      "Start with an Example",
      "Offers quick test templates: Function Calling, Summarization, Document Q&A.",
      "Try example scenarios to understand model behavior.",
      "Evaluation Section",
      "Helps evaluate model responses.",
      "Assess accuracy, relevance, and quality of model outputs.",
      "Prompt Input Area",
      "Text box at the bottom (\"Start typing...\").",
      "Enter prompts, run queries, and see model responses interactively.",
      "For AI Developers",
      "The Playground supports:",
      "Unity Catalog AI Tools — governed access to enterprise data.",
      "Databricks Foundation Models — like MPT, Llama 2, GPT OSS, etc.",
      "Custom Tool Integration — connect APIs or databases to your AI agent.",
      "Prompt Evaluation — test, compare, and optimize prompts before production use.",
      "Advanced Features",
      "Feature",
      "Description",
      "🧩 Agent Prototyping",
      "Create and test agents that can use APIs, databases, or documents.",
      "🔗 Function Calling",
      "Extend the model’s capabilities by allowing it to call your defined Python or SQL functions.",
      "🧾 Prompt Testing",
      "Evaluate how prompts perform across models.",
      "📊 Evaluation Tools",
      "Use built-in metrics to test model quality (accuracy, bias, hallucination rate).",
      "🔐 Unity Catalog Integration",
      "Ensure data governance and secure access during AI experiments.",
      "Benefits",
      "Benefit",
      "Description",
      "🧠 Hands-on AI Development",
      "Experiment freely without deployment setup.",
      "🔍 Prompt Optimization",
      "Refine and evaluate prompts before production.",
      "🧩 Custom Tool Integration",
      "Combine AI reasoning with data or APIs.",
      "🔒 Governance",
      "Integrated with Unity Catalog for secure and auditable AI testing.",
      "🌐 Multiple Model Access",
      "Test open-source and Databricks-hosted LLMs.",
      "Experiments",
      "In Databricks, Experiments represent the core of model development and tracking.An experiment records each run of your machine learning or AI workflow — including:",
      "Model parameters (like learning rate, epochs)",
      "Metrics (like accuracy, loss)",
      "Code version",
      "Data version",
      "Model artifacts (like trained models)",
      "Experiments help track, compare, and reproduce model performance over time using MLflow.",
      "The Experiments module integrates tightly with MLflow 3, providing:",
      "Unified tracking for ML, DL, and GenAI experiments.",
      "Versioning for both data and models.",
      "Prompt tracking for LLM fine-tuning and evaluation.",
      "Advanced observability — including lineage and traceability for GenAI agents.",
      "Visible Sections:",
      "Section",
      "Description",
      "🧠 GenAI apps & agents",
      "For building and tracking Generative AI apps or AI agents.",
      "📉 Regression",
      "Create regression models automatically using AutoML.",
      "🔮 Forecasting (Preview)",
      "Build time-series forecasting models.",
      "🧩 Classification",
      "Train classification models (binary or multi-class).",
      "⚙️ Custom model training",
      "For custom classical ML or deep learning experiments.",
      "Experiment Management Options",
      "Option",
      "Purpose",
      "🔍 Filter experiments",
      "Search for experiments by name, tag, or creator.",
      "👤 Only my experiments",
      "Shows experiments created by the current user.",
      "🔁 Reset filters",
      "Clears search and shows all experiments.",
      "🧾 Experiment List Table",
      "Displays Name, Created by, Last modified, Location, and Description.",
      "Core Functionalities",
      "Function",
      "Description",
      "🧠 AutoML Experiments",
      "Automatically builds and tunes models for regression, classification, or forecasting tasks.",
      "🧩 Custom Model Training",
      "Allows full control of model code — supports PyTorch, TensorFlow, Scikit-learn, etc.",
      "🤖 GenAI & LLM Tracking",
      "Records prompt configurations, LLM outputs, and tool usage for AI agents.",
      "📊 Experiment Comparison",
      "Lets you visually compare multiple runs — metrics, parameters, and outputs.",
      "🔗 Integration with Feature Store & Models",
      "Once the best model is found, link it to the Model Registry for deployment.",
      "Advanced Capabilities (MLflow 3 + Databricks)",
      "Capability",
      "Description",
      "📘 Prompt Versioning",
      "For LLM-based experiments — tracks prompt templates and versions.",
      "🧭 LLM Judges",
      "Evaluate AI outputs automatically (quality, relevance, hallucinations).",
      "🧩 Unified ML + GenAI Tracking",
      "Track classical ML, DL, and GenAI in one interface.",
      "🧾 Agent Tracing",
      "Trace multi-step reasoning of AI agents end-to-end.",
      "🧠 Enhanced Model Logging",
      "Log not just metrics, but embeddings, prompts, and responses.",
      "Benefits",
      "Benefit",
      "Description",
      "📊 Full visibility",
      "Every model training run is recorded with detailed logs.",
      "🔁 Reproducibility",
      "Easily re-run any experiment exactly as before.",
      "🔍 Comparative analysis",
      "Identify best-performing models visually.",
      "🧩 Integration with Models & Serving",
      "Move successful experiments straight to production.",
      "🔐 Governance & Version Control",
      "Integrated with Unity Catalog for compliance and traceability.",
      "Features",
      "In Machine Learning, features are the input variables (columns) used by a model to make predictions.For example:",
      "In a credit scoring model → income, age, loan_amount are features.",
      "In a product recommender → user_history, click_rate, category_interest are features.",
      "The Features tab in Databricks allows you to manage, share, and reuse these features across models and teams.",
      "The Feature Store in Databricks (integrated with Unity Catalog) provides:",
      "Centralized feature management",
      "Governed access using Unity Catalog",
      "Feature lineage tracking",
      "Online/offline store integration for model training and real-time inference",
      "It enables feature discovery, reuse, versioning, and monitoring at enterprise scale.",
      "Table Columns (once features exist):",
      "Column",
      "Description",
      "Table name",
      "Name of the feature table.",
      "Owner",
      "Who created or owns the feature table.",
      "Online stores",
      "Indicates if the feature is deployed for real-time access.",
      "Last written",
      "Timestamp of the latest update to the feature table.",
      "Tags",
      "Custom tags for searching/grouping features.",
      "Comment",
      "Description or notes about the feature table.",
      "Permissions & Governance",
      "You can assign permissions at different levels:",
      "Level",
      "Example",
      "Purpose",
      "Catalog",
      "main",
      "Manage data organization",
      "Schema",
      "retail",
      "Group related feature tables",
      "Table",
      "customer_features",
      "Control access to specific features",
      "This governance ensures compliance, security, and collaboration.",
      "Feature Store Components",
      "Component",
      "Description",
      "Feature Table",
      "Delta table registered as a feature set.",
      "Feature Lookup",
      "Mapping between input data and feature tables during training or inference.",
      "Training Set",
      "Merged dataset (features + labels) used for model training.",
      "Online Store",
      "Low-latency feature storage for serving models in production.",
      "Feature Lineage",
      "Tracks which data sources and transformations produced each feature.",
      "Key Benefits",
      "Benefit",
      "Explanation",
      "♻️ Feature Reusability",
      "Build once, use everywhere — across teams and projects.",
      "📊 Consistency",
      "Same feature logic is applied in training and serving.",
      "🔍 Discoverability",
      "Easily search and explore existing features.",
      "🧾 Governance",
      "Controlled via Unity Catalog with fine-grained access control.",
      "🧠 Lineage & Audit",
      "Full visibility from raw data → feature → model → prediction.",
      "Advanced Options (for Professionals)",
      "Capability",
      "Description",
      "🧩 Batch & Streaming Features",
      "Supports both static and streaming feature tables.",
      "🌐 Real-time Inference",
      "Integrates with Redis, Cosmos DB, or custom online stores.",
      "🧬 Feature Monitoring",
      "Detects drift in feature distributions over time.",
      "🧠 Feature Versioning",
      "Track and manage changes in feature definitions.",
      "🧰 Integration with MLflow",
      "Features used in experiments are automatically logged for reproducibility.",
      "Models",
      "`This section is part of Databricks Machine Learning.  it helps you register, version, manage, and serve ML models built using MLflow or other frameworks.",
      "Currently, no models are registered yet. But once you create or import models, the table will display:",
      "Column",
      "Description",
      "Name",
      "The model’s registered name.",
      "Catalog",
      "The Unity Catalog that stores the model (e.g., main, sandbox, etc.).",
      "Schema",
      "The schema inside the catalog that holds the model.",
      "Last Modified",
      "Timestamp of the latest model version update.",
      "Owner",
      "The Databricks user or service principal who owns the model.",
      "Unity Catalog / Workspace Model Registry",
      "Unity Catalog → For governance and access control across workspaces.",
      "Workspace Model Registry → Local registry (older style, per workspace).",
      "Owned by Me / Owner Filter → Filter to show only models you own or specific users’ models.",
      "Search Bar → Search registered models by name.",
      "Once Models Exist — More Options Appear",
      "When you have registered models, you get these additional actions:"
    ],
    "images": []
  },
  "1. Model Versioning": {
    "paragraphs": [
      "1. Model Versioning",
      "Each model can have multiple versions (v1, v2, …) for tracking updates or retraining cycles."
    ],
    "images": []
  },
  "2. Model Staging": {
    "paragraphs": [
      "2. Model Staging",
      "Models can have lifecycle stages:",
      "None – Just registered",
      "Staging – For testing and validation",
      "Production – For deployment",
      "Archived – Old or deprecated versions"
    ],
    "images": []
  },
  "3. Model Lineage & Metadata": {
    "paragraphs": [
      "3. Model Lineage & Metadata",
      "Tracks which experiment/run created the model.",
      "Shows training dataset lineage (via Unity Catalog).",
      "Metadata like tags, parameters, and metrics appear automatically from MLflow."
    ],
    "images": []
  },
  "4. Permissions": {
    "paragraphs": [
      "4. Permissions",
      "You can manage who can:",
      "Read or use the model",
      "Transition model stages",
      "Delete or update versions"
    ],
    "images": []
  },
  "5. Serving Integration": {
    "paragraphs": [
      "5. Serving Integration",
      "Once a model is registered and approved, you can:",
      "Deploy it to Databricks Model Serving",
      "Expose it via REST API endpoint for predictions",
      "Integrate with Feature Store for consistent feature usage",
      "Serving",
      "Model Serving in Databricks allows you to:",
      "Deploy ML models (including LLMs) for real-time predictions",
      "Expose them via REST APIs",
      "Serve open-source or external models (like GPT, Llama)",
      "Automatically scale endpoints based on demand",
      "Secure access with Unity Catalog and IAM policies",
      "Details from the Screenshot",
      "Column",
      "Description",
      "Name",
      "The name of the deployed serving endpoint.",
      "State",
      "The current deployment status (e.g., Ready, Deploying, Failed).",
      "Served entities",
      "The specific model or model version being served (e.g., GPT OSS 120B, Llama 4 Maverick).",
      "Tags",
      "Metadata tags (e.g., Chat, Embeddings).",
      "Task",
      "The model type or function — Chat (LLMs), Embeddings (vectorization), etc.",
      "Created by",
      "User or system who deployed the endpoint.",
      "Last modified",
      "Timestamp of the latest deployment change.",
      "Top Models You See Here",
      "These are Databricks-hosted and external foundation models for chat and embeddings tasks:",
      "Model",
      "Type",
      "Description"
    ],
    "images": []
  },
  "GPT OSS 120B / 20B": {
    "paragraphs": [
      "GPT OSS 120B / 20B",
      "Databricks-hosted",
      "Large open-source GPT-style models for conversational AI.",
      "OpenAI GPT-5",
      "External",
      "Connects to OpenAI endpoint for inference (external integration).",
      "Llama 4 Maverick / Meta Llama Series",
      "Databricks-hosted",
      "Meta Llama models for chat/instruction tasks.",
      "Gemma 3 12B",
      "Databricks-hosted",
      "Google’s lightweight open LLMs.",
      "BGE / GTE Large (En)",
      "Embedding models",
      "Used for text embedding, retrieval, and similarity tasks.",
      "Actions Available per Model",
      "Each model endpoint (like GPT, Llama, etc.) gives you options such as:",
      "Action",
      "Description",
      "Use",
      "Opens an interface to test the model directly within Databricks.",
      "Copy",
      "Copies the REST API URL and authentication token.",
      "Configure",
      "Modify endpoint settings — scale, model version, environment variables.",
      "Create Serving Endpoint",
      "Deploy your own trained model or clone an existing one.",
      "Part of Full AI/ML Lifecycle",
      "Stage",
      "Databricks Feature",
      "Data Preparation",
      "Delta Live Tables / Notebooks / Unity Catalog",
      "Feature Engineering",
      "Features (Feature Store)",
      "Experiment Tracking",
      "Experiments (MLflow)",
      "Model Management",
      "Models (Model Registry)",
      "Model Deployment",
      "Serving (Real-time endpoints)",
      "Testing & Interaction",
      "Playground (Chat/LLM interaction UI)",
      "Notebook-level features",
      "A Databricks notebook is an interactive environment for:",
      "Writing and running code (Python, SQL, Scala, R)",
      "Visualizing data",
      "Managing ML workflows",
      "Collaborating and sharing results",
      "It supports multi-language notebooks meaning you can run Python, SQL, Scala, R, or Markdown in the same file using magic commands (like %python, %sql, %scala, %md).",
      "Key Notebook UI Features",
      "Feature",
      "Description",
      "🧾 Notebook Title (\"my notebook\")",
      "Editable notebook name. You can rename it anytime.",
      "📜 Toolbar",
      "Provides actions like Run, Connect, Schedule, Share, File options, etc.",
      "▶️ Run / Run all / Schedule",
      "Run current cell or all cells; schedule notebooks as automated jobs.",
      "🧠 Language Selector (Python, SQL, etc.)",
      "Set default language for the notebook.",
      "🌐 Connect",
      "Connects the notebook to a cluster (compute resource). Required before execution.",
      "🔗 Share",
      "Share the notebook with team members or grant access via permissions.",
      "⚙️ Settings / Comments / Command Palette",
      "Quick access to environment settings and collaborative comments.",
      "Code Cell Features",
      "Each code cell (like the one in your screenshot) has:",
      "Option",
      "Description",
      "▶️ Run Cell",
      "Executes the code within the selected cell.",
      "⠿ Drag Handle",
      "Allows you to reorder or move cells.",
      "🔍 Language Indicator (Python)",
      "Shows the language mode of the current cell.",
      "🧩 Add Cell Above/Below",
      "Insert new code or markdown cells.",
      "🧹 Clear Output",
      "Removes output from the cell without deleting code.",
      "🗑️ Delete Cell",
      "Deletes the current cell.",
      "File-level Features",
      "File menu contains all options related to creating, managing, importing, exporting, and sharing notebooks in Databricks.",
      "📂 Databricks Notebook – File Menu",
      "Menu Option",
      "Description & Usage",
      "🆕 New notebook",
      "Opens a brand-new notebook. You can choose the language (Python, SQL, Scala, or R) and cluster later.",
      "📥 Import…",
      "Allows you to import existing notebooks (from .dbc, .html, .ipynb, or Git repositories).",
      "🧭 New notebook dashboard",
      "Creates a dashboard view — ideal for visualizations and results presentation, often used in reporting.",
      "🔗 Share…",
      "Opens the sharing dialog where you can grant permissions to other users or groups (View, Run, Edit, Manage).",
      "⏰ Schedule…",
      "Lets you schedule notebook runs at set intervals (daily, hourly, etc.) — useful for data pipelines or automation.",
      "⚙️ Change default cell language…",
      "Sets the default language (Python, SQL, Scala, or R) for new cells in this notebook.",
      "🧠 Commit to Git…",
      "Integrates with Git (GitHub, GitLab, Azure Repos) — allows version control, branching, and pushing changes.",
      "🌀 Clone…",
      "Makes an identical copy of the current notebook within the workspace.",
      "✏️ Rename…",
      "Rename the notebook file name.",
      "📤 Export…",
      "Export notebook in multiple formats:– HTML (read-only view)– SOURCE (plain text)– DBC archive– IPYNB (Jupyter notebook format).",
      "📦 Move…",
      "Move notebook to a different folder or workspace location.",
      "🗑️ Move to trash",
      "Deletes (moves) notebook to Trash; can be restored later if needed.",
      "🧱 Notebook format ›",
      "Sub-menu to choose export format or convert to different type (e.g., source code, HTML, IPYNB).",
      "⬆️ Upload files to volume…",
      "Uploads files (datasets, scripts, etc.) directly into a mounted volume or workspace for use in your notebook.",
      "🧮 Create or modify table…",
      "Opens Databricks Data UI to create or edit tables (either Delta or other supported file formats).",
      "📊 Add data ›",
      "Opens data ingestion options to connect to data sources (Azure Blob, ADLS, Delta tables, CSVs, etc.).",
      ".",
      "🔹 1. New Notebook",
      "Creates a new Databricks notebook.",
      "You can choose the language (Python, SQL, Scala, R).",
      "Optionally select a cluster to attach before running code.",
      "🔹 2. Import",
      "Used to import existing notebooks or code files.",
      "Supported formats:",
      ".dbc (Databricks archive)",
      ".py, .ipynb, .r, .scala",
      "You can import from:",
      "Local machine"
    ],
    "images": []
  },
  "URL": {
    "paragraphs": [
      "URL",
      "Git repository",
      "🔹 3. New Notebook Dashboard",
      "Creates a Dashboard view for notebook outputs.",
      "Dashboards allow you to pin visualizations and results from one or more notebooks to share with others (useful for reporting).",
      "🔹 4. Share",
      "Opens the sharing dialog to control notebook access.",
      "You can:",
      "Add collaborators (with View / Edit / Run permissions)",
      "Share via workspace, link, or group",
      "Control access to comments and output visibility",
      "🔹 5. Schedule",
      "Allows you to automate notebook runs.",
      "You can:",
      "Set time-based schedules (daily, weekly, etc.)",
      "Configure cluster and parameters for each run",
      "Send email notifications or webhook alerts upon completion/failure",
      "🔹 6. Change Default Cell Language",
      "Lets you choose the default programming language for all new cells in the notebook.",
      "Supported languages:",
      "Python"
    ],
    "images": []
  },
  "SQL": {
    "paragraphs": [
      "SQL",
      "Scala",
      "SQL",
      "Allows you to write SQL queries directly within the notebook.",
      "Often used for querying data from Delta tables or databases.",
      "Integrates well with Databricks’ data management and visualization tools.",
      "Scala",
      "Used for working directly with Apache Spark’s core language.",
      "Offers performance advantages and full access to Spark APIs.",
      "Often preferred by data engineers for large-scale data transformations."
    ],
    "images": []
  },
  "R": {
    "paragraphs": [
      "R",
      "(You can still mix languages using cell magic commands like %python, %sql, etc.)",
      "🔹 7. Commit to Git",
      "Connects the notebook to a Git repository (GitHub, Azure DevOps, GitLab, Bitbucket, etc.).",
      "Allows you to:",
      "Commit changes",
      "View revision history",
      "Revert or pull updates",
      "🔹 8. Clone",
      "Creates a copy of the notebook in the same or another workspace folder.",
      "Useful for creating backup or template versions.",
      "🔹 9. Rename",
      "Renames the current notebook file.",
      "🔹 10. Export",
      "Exports the current notebook in one of several formats:",
      ".dbc (Databricks archive)",
      ".html (for static sharing)",
      ".ipynb (Jupyter-compatible)",
      ".source (plain code export)",
      "🔹 11. Move",
      "Moves the notebook to a different workspace folder or directory.",
      "🔹 12. Move to Trash",
      "Sends the notebook to the Trash folder in Databricks.",
      "You can later restore or permanently delete it.",
      "🔹 13. Notebook Format",
      "Selects how notebook content is saved and versioned.",
      "Two options:",
      "Source file format: saves as plain text (easier for Git versioning).",
      "DBC archive format: compressed binary (used for backups).",
      "🔹 14. Upload Files to Volume",
      "Uploads local files (like CSVs, JSONs, etc.) directly to:",
      "DBFS (Databricks File System) or",
      "Mounted Azure Storage / AWS S3 / GCP bucket.",
      "🔹 15. Create or Modify Table",
      "Opens the Data Import Wizard.",
      "You can load data files (CSV, Parquet, JSON, etc.) into a table in:",
      "Delta Lake",
      "Hive Metastore",
      "Unity Catalog",
      "🔹 16. Add Data",
      "Shortcut to Databricks Add Data interface, which lets you:",
      "Browse uploaded files",
      "Connect to external data sources (SQL DBs, cloud storage)",
      "Automatically create tables from uploaded data",
      "Edit level features",
      "Edit menu provides tools for:",
      "Managing and rearranging cells",
      "Editing and formatting code",
      "Controlling execution flow (skip/unskip)",
      "Performing notebook-wide formatting and search",
      "Setting parameters for automated or reusable notebooks",
      "Databricks Notebook – Edit Menu",
      "Menu Option",
      "Shortcut (Windows/Linux)",
      "Description",
      "Undo",
      "Ctrl + Z",
      "Reverses the most recent cell edit or deletion.",
      "Cut cell(s)",
      "Ctrl + X",
      "Removes the selected cell(s) and copies them to the clipboard.",
      "Copy cell(s)",
      "Ctrl + C",
      "Copies selected cell(s) to the clipboard.",
      "Paste cell(s)",
      "Ctrl + V",
      "Pastes the copied or cut cell(s) below the current one.",
      "Delete cell(s)",
      "R",
      "For data analysis and statistical modeling.",
      "Ideal for data scientists working in R environments.",
      "Supports packages like ggplot2 and dplyr.",
      "💡 Usage Tip:",
      "You can mix languages in a single notebook by prefixing a cell with:",
      "%python",
      "%sql",
      "%scala",
      "%r",
      "Others features",
      "Grid/Outline View Icon",
      "Purpose: Opens the notebook’s table of contents or cell outline view.",
      "Use: Lets you navigate quickly between notebook cells or sections especially helpful in long notebooks.",
      "Run all",
      "Purpose: Executes all code cells in the notebook sequentially from top to bottom.",
      "Use: Used when you want to rerun the entire notebook (e.g., after making changes to inputs or variables).",
      "Connect",
      "Purpose: Manages your cluster connection.",
      "Use:",
      "Shows which cluster the notebook is currently attached to.",
      "Lets you connect, disconnect, or switch clusters.",
      "The blue dot next to it means it’s currently connected.",
      "Schedule",
      "Purpose: Used to automate notebook runs.",
      "Use:",
      "You can set up recurring runs (daily, weekly, etc.).",
      "Often used for production tasks like data refreshes or batch jobs.",
      "Share",
      "Purpose: Manages collaboration and access permissions.",
      "Use:",
      "Lets you share the notebook with teammates.",
      "You can give view, edit, or run permissions."
    ],
    "images": []
  },
  "D, D": {
    "paragraphs": [
      "D, D",
      "Deletes the currently active cell(s). Press D twice quickly.",
      "Skip/Unskip cell(s)",
      "Ctrl + /",
      "Marks a cell to be skipped during “Run All” execution, or unskips it. Useful for temporarily disabling code.",
      "Cell Insertion and Arrangement",
      "Menu Option",
      "Shortcut",
      "Description",
      "Insert cell above"
    ],
    "images": []
  },
  "A": {
    "paragraphs": [
      "A",
      "Adds a new blank cell above the current one.",
      "Insert cell below"
    ],
    "images": []
  },
  "B": {
    "paragraphs": [
      "B",
      "Adds a new blank cell below the current one.",
      "Move cell up",
      "Ctrl + Alt + ↑",
      "Moves the selected cell upward in the notebook.",
      "Move cell down",
      "Ctrl + Alt + ↓",
      "Moves the selected cell downward in the notebook.",
      "Select all cells",
      "Ctrl + A",
      "Selects every cell in the notebook for bulk operations.",
      "Formatting and Structure",
      "Menu Option",
      "Shortcut",
      "Description",
      "Format cell(s)",
      "Ctrl + Shift + F",
      "Auto-formats code in the current cell (indentation, spacing).",
      "Format notebook",
      "—",
      "Automatically formats all cells for consistent code style.",
      "Notebook Python indentation…",
      "—",
      "Opens indentation settings for Python cells (tabs vs spaces, size).",
      "⚙️ Additional Utilities",
      "Menu Option",
      "Shortcut",
      "Description",
      "Add parameter…",
      "—",
      "Allows you to define notebook parameters (for parameterized runs using widgets).",
      "Find…",
      "Ctrl + F",
      "Opens a search bar to find specific words, code, or text within the notebook.",
      "🔹 1. Undo / Redo",
      "Undo (Ctrl + Z): Reverts your last action (e.g., deleting a cell, changing code).",
      "Redo (Ctrl + Shift + Z): Re-applies an undone action.",
      "🧠 Useful for quickly fixing mistakes during editing.",
      "🔹 2. Cut / Copy / Paste Cells",
      "Cut Cell: Removes the selected cell and stores it in clipboard.",
      "Copy Cell: Copies the selected cell’s content to clipboard.",
      "Paste Cell Below / Above: Inserts the copied/cut cell at a specific position.",
      "📋 Helps in reorganizing notebook structure efficiently.",
      "🔹 3. Move Cell Up / Down",
      "Moves the selected cell vertically within the notebook.",
      "Maintains execution order when rearranging your logic.",
      "🔹 4. Delete Cell",
      "Permanently deletes the selected cell from the notebook.",
      "Shortcut: Ctrl + D or Click Trash icon on cell toolbar.",
      "🔹 5. Add Cell Above / Below",
      "Quickly inserts a new empty cell above or below the selected one.",
      "The new cell defaults to the notebook’s primary language (e.g., Python).",
      "Shortcut:",
      "A → Add Above",
      "B → Add Below",
      "🔹 6. Merge with Cell Above / Below",
      "Combines the current cell with an adjacent one (above or below).",
      "Helps when you split code accidentally or want cleaner cell grouping.",
      "🔹 7. Split Cell",
      "Splits the current cell at the cursor position into two new cells.",
      "Keeps the same language type for both new cells.",
      "Shortcut: Ctrl + Shift + –",
      "🔹 8. Find and Replace",
      "Opens a search bar to find text or code patterns in the notebook.",
      "You can also replace text directly.",
      "Supports:",
      "Match Case",
      "Regex search",
      "Replace All",
      "Shortcut: Ctrl + F / Ctrl + H",
      "🔹 9. Clear Output",
      "Removes all generated outputs (plots, tables, logs) from the notebook cells.",
      "Options:",
      "Clear Output for Current Cell",
      "Clear Output for All Cells",
      "🧹 Good practice before sharing or committing notebooks to Git.",
      "🔹 10. Clear State",
      "Resets the Python/Scala/R session (similar to restarting the kernel).",
      "Clears all variables, imports, and cached data.",
      "🔄 Use when memory is full or to rerun from a clean state.",
      "🔹 11. Run Selected Cell / All Cells",
      "Executes:",
      "Current Cell",
      "All Cells Above / Below",
      "All Cells in Notebook",
      "Shortcut:",
      "Shift + Enter → Run and move to next cell",
      "Ctrl + Enter → Run cell only",
      "Alt + Enter → Run and insert new cell below",
      "🔹 12. Convert Cell Type",
      "Converts between:",
      "Code Cell",
      "Markdown Cell",
      "Useful for adding formatted text, documentation, or section titles.",
      "Shortcut:",
      "Ctrl + M M (convert to markdown)",
      "Ctrl + M Y (convert to code)",
      "🔹 13. Comment / Uncomment",
      "Toggles comment lines in a code cell.",
      "Automatically detects language syntax (Python #, SQL --, etc.).Shortcut: Ctrl + /",
      "🔹 14. Format Cell Code",
      "Auto-formats code indentation and spacing.",
      "Improves readability (especially in long notebooks).Shortcut: Ctrl + Shift + F",
      "🔹 15. Toggle Line Numbers",
      "Shows or hides line numbers in code cells.",
      "Helpful for debugging or referencing code during collaboration.",
      "🔹 16. Toggle Output Visibility",
      "Hides or shows the output section of a cell (results, plots, etc.).",
      "Useful for compact viewing when outputs are large.",
      "🔹 17. Toggle Comments Panel",
      "Shows the collaboration comment sidebar.",
      "Lets you add inline comments, tag teammates, or resolve feedback.",
      "View level features",
      "View menu allows you to:",
      "Customize notebook interface and theme",
      "Control code and output visibility",
      "Manage cluster tools and developer options",
      "Access reusable SQL query snippets",
      "Databricks Notebook – View Menu Overview",
      "The View menu allows you to customize the notebook interface, control UI layout, and access developer or cluster tools.",
      "Views",
      "This submenu lets you switch between various Databricks notebook views.",
      "Option",
      "Description",
      "Command Mode / Edit Mode",
      "Switch between cell editing (Enter) and command mode (Esc).",
      "Presentation Mode",
      "Displays notebook in a clean, full-screen layout — useful for demos or teaching.",
      "Code-only / Results-only view",
      "Toggle between hiding code cells or outputs for a focused view.",
      "Show Line Numbers",
      "Enables/disables line numbers in code cells for easier debugging.",
      "Notebook Layout",
      "Adjusts the overall layout of your Databricks notebook window.",
      "Option",
      "Description",
      "Default layout",
      "Standard view with toolbar, output, and code cells visible.",
      "Compact layout",
      "Reduces padding and spacing for denser code display.",
      "Wide layout",
      "Expands notebook width — useful for long code lines or wide tables.",
      "Cell Layout",
      "Controls how individual notebook cells appear.",
      "Option",
      "Description",
      "Show cell toolbar",
      "Enables a toolbar on each cell for easy access to actions (move, delete, edit).",
      "Show output by default",
      "Displays the output section for all cells after execution.",
      "Collapse code/output",
      "Collapses code or output areas — useful for large notebooks.",
      "Show execution time",
      "Displays how long each cell took to execute.",
      "Workspace Theme",
      "Controls the Databricks workspace UI color theme.",
      "Option",
      "Description",
      "Light Theme",
      "Bright background; default mode.",
      "Dark Theme",
      "Dark background; reduces eye strain during long sessions.",
      "System Default",
      "Adapts to your OS theme setting automatically.",
      "Editor Theme",
      "Changes the theme used inside the code editor (cell area).",
      "Option",
      "Description",
      "Monokai / Solarized / Light / Dark",
      "Various syntax-highlighting color schemes for the code editor.",
      "Side Panel",
      "Controls the visibility and behavior of the left sidebar (Workspace, Recents, Catalog, etc.).",
      "Option",
      "Description",
      "Show / Hide side panel",
      "Toggles the entire left sidebar.",
      "Pin / Unpin panel",
      "Keeps the sidebar visible or allows it to auto-hide.",
      "Resize panel",
      "Adjusts the sidebar width.",
      "Appearance",
      "Manages minor UI preferences.",
      "Option",
      "Description",
      "Show toolbars",
      "Toggles the notebook’s top toolbar (Run, Connect, Share buttons).",
      "Show command palette shortcut tips",
      "Enables small shortcut hints under the notebook.",
      "Cluster Tools",
      "Provides quick access to Databricks cluster monitoring and management.",
      "Option",
      "Description",
      "View Cluster Logs",
      "Opens logs for the currently attached compute cluster.",
      "Cluster Details",
      "Opens the attached cluster’s configuration (runtime, libraries, etc.).",
      "Driver & Worker info",
      "Displays performance metrics for driver and worker nodes.",
      "Developer Settings",
      "Used for advanced users or developers to customize notebook behavior.",
      "Option",
      "Description",
      "Enable Developer Mode",
      "Turns on advanced tools such as HTML inspector, custom scripts, etc.",
      "Show debug console",
      "Displays developer console for debugging front-end issues.",
      "Query Snippets",
      "Opens Databricks’ reusable SQL code snippets library.",
      "Option",
      "Description",
      "Query Snippets window",
      "Opens a new panel with predefined or custom SQL templates for queries.",
      "🔹 1. Views",
      "Provides options to change the overall view of your notebook interface.",
      "Common options:",
      "Command mode view: shows toolbar and menus.",
      "Presentation view: hides toolbars and shows only notebook content for presentations.",
      "Full-screen view: expands the notebook to use full display space.",
      "🧠 Best for teaching sessions, demos, or focusing on code.",
      "🔹 2. Notebook Layout",
      "Controls how your notebook’s interface is displayed.",
      "Options include:",
      "Show/Hide Cell Toolbar – toggle visibility of the toolbar above each cell.",
      "Show Line Numbers – display line numbers inside code cells.",
      "Collapse/Expand Output – hide or show outputs (plots, tables, etc.).",
      "Enable Output Scrolling – adds scrollbars for long outputs instead of overflowing.",
      "💡 Helps declutter large notebooks or improve visual clarity.",
      "🔹 3. Cell Layout",
      "Adjusts the way individual cells are displayed and interacted with.",
      "Options include:",
      "Toggle Input Visibility – hide or show the input (code) area of a cell.",
      "Toggle Output Visibility – hide or show only the results/output area.",
      "Wrap Text in Cells – wraps long lines instead of horizontal scrolling.",
      "📋 Ideal when reviewing code or hiding logic for visual focus.",
      "🔹 4. Workspace Theme",
      "Change the overall Databricks interface color scheme.",
      "Options:",
      "Light Theme",
      "Dark Theme",
      "🌗 Switch depending on comfort or lighting conditions.",
      "🔹 5. Editor Theme",
      "Changes the syntax highlighting style inside the code editor only.(Independent of workspace theme.)",
      "Options often include:",
      "Default",
      "Monokai",
      "Solarized Light/Dark",
      "High Contrast",
      "🎨 Useful for developers who prefer specific color styles.",
      "🔹 6. Side Panel",
      "Manage visibility of left-hand and right-hand navigation panels.",
      "Options:",
      "Show/Hide Sidebar – toggle workspace navigation bar.",
      "Show File Browser / Data / Clusters / Jobs panels.",
      "Show Comments / Insights Panel on right side.",
      "🧱 Helpful for focusing or expanding workspace tools.",
      "🔹 7. Appearance",
      "Fine-tunes display settings related to text size and spacing.",
      "Options:",
      "Zoom In / Zoom Out – increase or decrease text size.",
      "Reset Zoom – return to default.",
      "Toggle Compact Mode – reduce spacing between cells.",
      "👓 Improves readability or space management.",
      "🔹 8. Cluster Tools",
      "Allows quick visibility of cluster-related panels.",
      "Options:",
      "Show Cluster Info Panel – view current attached cluster details.",
      "Show Logs / Metrics – open cluster monitoring or Spark UI links.",
      "⚙️ Useful for debugging job or runtime issues directly from notebook.",
      "🔹 9. Developer Settings",
      "Opens advanced options for developers such as:",
      "Enable Experimental Features",
      "Enable Command Palette Shortcuts",
      "Enable AI Assistant Beta (if available)",
      "🧪 For developers testing new Databricks capabilities.",
      "🔹 10. Query Snippets",
      "Opens pre-saved reusable SQL or Python code snippets.",
      "You can view, insert, or manage snippets for faster notebook development.",
      "⚡ Saves time by reusing common queries or functions.",
      "Run-level features",
      "The Run menu in Databricks allows you to execute, debug, clear outputs, and control compute sessions in your notebook.",
      "It’s primarily used for running code cells and managing the execution environment.",
      "Run and Debug",
      "This section provides options to execute cells in different ways.",
      "Options:",
      "Run Cell / Run All Cells → Executes the selected or all notebook cells sequentially.",
      "Run Cell and Move to Next → Runs the current cell, then automatically jumps to the next one.",
      "Run Above / Run Below → Executes all cells either above or below the currently selected cell.",
      "Debug Cell (if enabled) → Allows step-by-step execution for debugging purposes.",
      "💡 Use when testing logic or running the whole notebook for analysis or data processing.",
      "Clear",
      "This section helps you remove outputs or states from the notebook.",
      "Options:",
      "Clear Output of Current Cell → Removes the result/output displayed for the current cell.",
      "Clear Output of All Cells → Clears all results throughout the notebook (code remains intact).",
      "Clear State → Resets notebook variables or execution state (optional in some setups).",
      "🧹 Useful before re-running code to avoid confusion from old outputs.",
      "Go to Last Run Cell",
      "Jumps directly to the last executed cell in the notebook.",
      "Helps quickly find where you last left off in a long notebook.",
      "🔁 Very handy for debugging or when resuming work after a pause.",
      "Interrupt Execution (Shortcut: I, I)",
      "Immediately stops a running cell or notebook execution.",
      "Similar to “Stop” or “Cancel” in other IDEs.",
      "Use this if a cell is taking too long or stuck in an infinite loop.",
      "⏹️ Prevents resource wastage or cluster overload.",
      "Detach from Compute Resource",
      "Disconnects the notebook from the currently attached Databricks cluster or compute resource.",
      "After detaching, no code execution can occur until reconnected.",
      "⚙️ Used when switching clusters, stopping resources, or cleaning up sessions.",
      "New Session in Compute Resource",
      "Starts a fresh session within the currently attached cluster.",
      "Clears the existing Python/Scala/R environment (variables, imports, etc.).",
      "Essentially “restarts the kernel” for a clean state.",
      "🔄 Useful when environment corruption or dependency conflicts occur.",
      "Menu Option",
      "Purpose",
      "Key Use Case",
      "Run and Debug",
      "Execute selected/all cells",
      "Run or debug code interactively",
      "Clear",
      "Remove outputs or execution states",
      "Clean notebook before rerun",
      "Go to Last Run Cell",
      "Jump to last executed cell",
      "Resume work or debug flow",
      "Interrupt Execution (I, I)",
      "Stop current execution",
      "Abort long or stuck runs",
      "Detach from Compute Resource",
      "Disconnect cluster",
      "Switch or stop compute",
      "New Session in Compute Resource",
      "Restart environment",
      "Start fresh session for clean execution",
      "Help-level features",
      "Search actions",
      "Purpose: Opens a search bar to quickly find and execute commands or actions within the notebook.",
      "Shortcut: Ctrl + Shift + P",
      "Use: This allows users to rapidly search through available actions or commands without navigating through menus.",
      "Keyboard shortcuts",
      "Purpose: Displays a list of all available keyboard shortcuts for the notebook.",
      "Shortcut: H (when \"Help\" is active)",
      "Use: This is a helpful guide for users to quickly learn and use shortcuts, speeding up the workflow. Shortcuts might include things like running cells or navigating between them.",
      "Provide feedback",
      "Purpose: Opens a prompt where users can provide feedback about their experience with Databricks.",
      "Use: This allows users to share their thoughts or report issues they have encountered while using Databricks.",
      "Ask the Databricks community",
      "Purpose: Opens a link to the Databricks community forum or help center where users can ask questions or browse discussions.",
      "Use: This connects users to the community for support, troubleshooting, or knowledge sharing.",
      "Databricks support",
      "Purpose: Provides a link to official Databricks support resources, including contact information or technical assistance options.",
      "Use: This feature is for users who need direct, official support for their Databricks environment or facing issues that community help may not address.",
      "Language-level features",
      "Purpose:Sets the default programming language for the current notebook.All new cells you create will use the selected language automatically, though you can still override it in individual cells.",
      "Available options:",
      "Python",
      "Default and most commonly used option.",
      "Supports libraries like PySpark, pandas, NumPy, matplotlib, etc.",
      "Used for data processing, machine learning, and automation tasks."
    ],
    "images": []
  },
  "1. Comments": {
    "paragraphs": [
      "1. Comments",
      "Feature: Comments allow users to add notes, feedback, or annotations to cells in the notebook. It's an important feature for collaboration.",
      "Functionality: You can click on the comment icon, add comments, and reply to other users' comments. This helps teams work together on the notebook without modifying the actual code."
    ],
    "images": []
  },
  "2. MLflow": {
    "paragraphs": [
      "2. MLflow",
      "Feature: MLflow is an open-source platform used for managing the machine learning lifecycle. In Databricks, MLflow allows you to track experiments, organize models, and manage versioning and deployment.",
      "Functionality: You can use it to log model parameters, metrics, artifacts, and even manage model registry, which can be useful for tracking different versions of models and their performance."
    ],
    "images": []
  },
  "3. Version History": {
    "paragraphs": [
      "3. Version History",
      "Feature: This allows you to view previous versions of the notebook, track changes, and revert to earlier versions if needed.",
      "Functionality: You can see the notebook’s change history, who made the changes, and when. You can roll back to a specific version if necessary, which is great for tracking progress and restoring work in case of mistakes."
    ],
    "images": []
  },
  "4. Variables": {
    "paragraphs": [
      "4. Variables",
      "Feature: In Databricks, variables show the current session's defined variables, including their values. This helps you track what’s available in the current environment (e.g., the output of cells, the current state of dataframes, etc.).",
      "Functionality: It helps to inspect and manage variables directly from the sidebar. You can view the current state of variables, which is useful when working with large datasets or complex computations."
    ],
    "images": []
  },
  "5. Environment": {
    "paragraphs": [
      "5. Environment",
      "Feature: The environment shows the runtime or environment context in which the notebook is executing. This can include the libraries installed, the Python/Scala/SQL environment, and the cluster configuration.",
      "Functionality: It allows you to see which cluster or environment the notebook is using, including the versions of libraries that are installed. If you need a different environment (e.g., upgrading libraries or switching clusters), you can manage this from here."
    ],
    "images": []
  },
  "6. Assistant": {
    "paragraphs": [
      "6. Assistant",
      "Feature: The assistant likely refers to an AI or virtual assistant integrated into Databricks to help with code suggestions, troubleshooting, and providing guidance within the notebook.",
      "Functionality: You can ask the assistant questions related to the notebook, such as asking for code completion, debugging help, or natural language translation of data queries. It's a helpful tool for improving productivity, especially when working with complex data science tasks."
    ],
    "images": []
  }
}